## Importing Dependencies

In [1]:
import pandas as pd
import numpy as np
import re
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import StandardScaler, MinMaxScaler

## Load Walmart data into a DataFrame

In [2]:
df = pd.read_csv("./clean_walmart_data.csv",encoding_errors='ignore')
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,Day,Month,Year
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05-01-2019,1:08 PM,Ewallet,9.1,0.48,Sat,Jan,2019
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08-03-2019,10:29 AM,Cash,9.6,0.48,Fri,Mar,2019
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03-03-2019,1:23 PM,Credit card,7.4,0.33,Sun,Mar,2019
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27-01-2019,8:33 PM,Ewallet,8.4,0.33,Sun,Jan,2019
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08-02-2019,10:37 AM,Ewallet,5.3,0.48,Fri,Feb,2019

## 1. Walmart Data Frame Information.

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  float64
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
 11  Day             10051 non-null  object
 12  Month           10051 non-null  object
 13  Year            10051 non-null  int64
dtypes: float64(4), int64(2), object(8)
memory usage: 1.1+ MB

## 2. Check the Dimensions of a DataFrame in Pandas

In [4]:
df.shape

(10051, 14)

### Check Columns

In [5]:
df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin', 'Day',
       'Month', 'Year'],
      dtype='object')

## Statistical Summary of the DataFrame

In [6]:
df.describe()

,invoice_id,unit_price,quantity,rating,profit_margin,Year
count,10051.000000,10020.000000,10020.000000,10051.000000,10051.000000,10051.000000
mean,5025.741220,50.630053,2.353493,5.825659,0.393791,2021.249826
std,2901.174372,21.197783,1.602658,1.763991,0.090669,1.294292
min,1.000000,10.080000,1.000000,3.000000,0.180000,2019.000000
25%,2513.500000,32.000000,1.000000,4.000000,0.330000,2020.000000
50%,5026.000000,51.000000,2.000000,6.000000,0.330000,2021.000000
75%,7538.500000,69.000000,3.000000,7.000000,0.480000,2022.000000
max,10000.000000,99.960000,10.000000,10.000000,0.570000,2023.000000

## Calculate Total Price for Each Transaction

In [7]:
df['Total_price'] = df['unit_price'] * df['quantity']

In [8]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,Day,Month,Year,Total_price
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05-01-2019,1:08 PM,Ewallet,9.1,0.48,Sat,Jan,2019,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08-03-2019,10:29 AM,Cash,9.6,0.48,Fri,Mar,2019,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03-03-2019,1:23 PM,Credit card,7.4,0.33,Sun,Mar,2019,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27-01-2019,8:33 PM,Ewallet,8.4,0.33,Sun,Jan,2019,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08-02-2019,10:37 AM,Ewallet,5.3,0.48,Fri,Feb,2019,604.17

## Check Null Value all the Data Set

In [9]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
Day                0
Month              0
Year               0
Total_price       31
dtype: int64

## Again Check Dimensions

In [10]:
df.shape

(10051, 15)

In [11]:
df['Total_price'].isnull().sum()

31

In [12]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
Day                0
Month              0
Year               0
Total_price       31
dtype: int64

In [13]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,Day,Month,Year,Total_price
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05-01-2019,1:08 PM,Ewallet,9.1,0.48,Sat,Jan,2019,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08-03-2019,10:29 AM,Cash,9.6,0.48,Fri,Mar,2019,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03-03-2019,1:23 PM,Credit card,7.4,0.33,Sun,Mar,2019,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27-01-2019,8:33 PM,Ewallet,8.4,0.33,Sun,Jan,2019,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08-02-2019,10:37 AM,Ewallet,5.3,0.48,Fri,Feb,2019,604.17

## Convert Data Types

In [14]:
df['date'] = pd.to_datetime(df['date'], dayfirst=True)

In [15]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,Day,Month,Year,Total_price
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,2019-01-05,1:08 PM,Ewallet,9.1,0.48,Sat,Jan,2019,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,2019-03-08,10:29 AM,Cash,9.6,0.48,Fri,Mar,2019,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,2019-03-03,1:23 PM,Credit card,7.4,0.33,Sun,Mar,2019,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,2019-01-27,8:33 PM,Ewallet,8.4,0.33,Sun,Jan,2019,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,2019-02-08,10:37 AM,Ewallet,5.3,0.48,Fri,Feb,2019,604.17

In [16]:
df.rename(columns={'unit_price':'unit_price_USD'}, inplace=True)

In [17]:
df.head()

,invoice_id,Branch,City,category,unit_price_USD,quantity,date,time,payment_method,rating,profit_margin,Day,Month,Year,Total_price
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,2019-01-05,1:08 PM,Ewallet,9.1,0.48,Sat,Jan,2019,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,2019-03-08,10:29 AM,Cash,9.6,0.48,Fri,Mar,2019,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,2019-03-03,1:23 PM,Credit card,7.4,0.33,Sun,Mar,2019,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,2019-01-27,8:33 PM,Ewallet,8.4,0.33,Sun,Jan,2019,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,2019-02-08,10:37 AM,Ewallet,5.3,0.48,Fri,Feb,2019,604.17

In [18]:
mean = round(df['Total_price'].mean(), 2)
mean

121.24

In [19]:
df['Total_price'].fillna(mean, inplace=True)

C:\Users\moham\AppData\Local\Temp\ipykernel_10340\3146238472.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Total_price'].fillna(mean, inplace=True)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price_USD  10020 non-null  float64
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  datetime64[ns]
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
 11  Day             10051 non-null  object
 12  Month           10051 non-null  object
 13  Year            10051 non-null  int64
 14  Total_price     10051 non-null  float64
dtypes: datetime64[ns](1), float64(5), int64(2), object(7)
memory usage: 1.2+ MB

## Fill All Numeric Column With mean

In [21]:
for col in df.select_dtypes(include=['float64','int64']).columns:
    print(col)
    df[col].fillna(df[col].mean(),inplace=True)

invoice_id
unit_price_USD
quantity
rating
profit_margin
Year
Total_price

C:\Users\moham\AppData\Local\Temp\ipykernel_10340\831188616.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].mean(),inplace=True)

In [22]:
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price_USD    0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
Day               0
Month             0
Year              0
Total_price       0
dtype: int64

In [23]:
df.head()

,invoice_id,Branch,City,category,unit_price_USD,quantity,date,time,payment_method,rating,profit_margin,Day,Month,Year,Total_price
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,2019-01-05,1:08 PM,Ewallet,9.1,0.48,Sat,Jan,2019,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,2019-03-08,10:29 AM,Cash,9.6,0.48,Fri,Mar,2019,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,2019-03-03,1:23 PM,Credit card,7.4,0.33,Sun,Mar,2019,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,2019-01-27,8:33 PM,Ewallet,8.4,0.33,Sun,Jan,2019,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,2019-02-08,10:37 AM,Ewallet,5.3,0.48,Fri,Feb,2019,604.17

## Find The duplicates Value

In [24]:
df.duplicated().sum()

51

## Delete All Duplicates Value

In [25]:
df.drop_duplicates(inplace=True)

In [26]:
total = sum(df['Total_price'])
total

1213484.82

In [27]:
df.to_csv('Clean_Walmart_data_1.csv', index=False)

In [28]:
df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price_USD',
       'quantity', 'date', 'time', 'payment_method', 'rating', 'profit_margin',
       'Day', 'Month', 'Year', 'Total_price'],
      dtype='object')